; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v1 ?v7)
		(pred_3 ?v2)
		(pred_2 ?v3)
		(pred_6 ?v3)
		(pred_1 ?v2 ?v3)
		(pred_4)
		(pred_5 ?v2))

   (:action op_1
       :parameters  (?v8 ?v4)
       :precondition (and (not-eq ?v8 ?v4) 
                          (pred_2 ?v8) (pred_2 ?v4) (pred_6 ?v8))
       :effect (and  (pred_6 ?v4)
		     (not (pred_6 ?v8))))


   (:action op_2
       :parameters (?v5 ?v6)
       :precondition  (and  (pred_3 ?v5) (pred_2 ?v6)
			    (pred_1 ?v5 ?v6) (pred_6 ?v6) (pred_4))
       :effect (and (pred_5 ?v5)
		    (not (pred_1 ?v5 ?v6)) 
		    (not (pred_4))))

   (:action op_3
       :parameters  (?v5  ?v6)
       :precondition  (and  (pred_3 ?v5) (pred_2 ?v6)
			    (pred_5 ?v5) (pred_6 ?v6))
       :effect (and (pred_1 ?v5 ?v6)
		    (pred_4)
		    (not (pred_5 ?v5)))))

; problem
(define (problem ferry-l5-c2)
(:domain ferry)
(:objects obj_07 obj_05 obj_02 obj_06 obj_04 
          obj_03 obj_01 
)
(:init
(pred_2 obj_07)
(pred_2 obj_05)
(pred_2 obj_02)
(pred_2 obj_06)
(pred_2 obj_04)
(pred_3 obj_03)
(pred_3 obj_01)
(not-eq obj_07 obj_05)
(not-eq obj_05 obj_07)
(not-eq obj_07 obj_02)
(not-eq obj_02 obj_07)
(not-eq obj_07 obj_06)
(not-eq obj_06 obj_07)
(not-eq obj_07 obj_04)
(not-eq obj_04 obj_07)
(not-eq obj_05 obj_02)
(not-eq obj_02 obj_05)
(not-eq obj_05 obj_06)
(not-eq obj_06 obj_05)
(not-eq obj_05 obj_04)
(not-eq obj_04 obj_05)
(not-eq obj_02 obj_06)
(not-eq obj_06 obj_02)
(not-eq obj_02 obj_04)
(not-eq obj_04 obj_02)
(not-eq obj_06 obj_04)
(not-eq obj_04 obj_06)
(pred_4)
(pred_1 obj_03 obj_04)
(pred_1 obj_01 obj_02)
(pred_6 obj_07)
)
(:goal
(and
(pred_1 obj_03 obj_05)
(pred_1 obj_01 obj_04)
)
)

(:constraints
  (and
    (sometime-before  (pred_1 obj_03 obj_05) (pred_6 obj_02))
    (sometime-before  (pred_1 obj_01 obj_04) (pred_6 obj_05))
  )
)
)

; plan
1. (op_1 obj_07 obj_02)
   deleted: (pred_6 obj_07)
   added: (pred_6 obj_02)
   goals met: 0 of 2
2. (op_2 obj_01 obj_02)
   deleted: (pred_1 obj_01 obj_02) (pred_4)
   added: (pred_5 obj_01)
   goals met: 0 of 2
3. (op_1 obj_02 obj_05)
   deleted: (pred_6 obj_02)
   added: (pred_6 obj_05)
   goals met: 0 of 2
4. (op_3 obj_01 obj_05)
   deleted: (pred_5 obj_01)
   added: (pred_1 obj_01 obj_05) (pred_4)
   goals met: 0 of 2
5. (op_1 obj_05 obj_04)
   deleted: (pred_6 obj_05)
   added: (pred_6 obj_04)
   goals met: 0 of 2
6. (op_2 obj_03 obj_04)
   deleted: (pred_1 obj_03 obj_04) (pred_4)
   added: (pred_5 obj_03)
   goals met: 0 of 2
7. (op_1 obj_04 obj_05)
   deleted: (pred_6 obj_04)
   added: (pred_6 obj_05)
   goals met: 0 of 2
8. (op_3 obj_03 obj_05)
   deleted: (pred_5 obj_03)
   added: (pred_1 obj_03 obj_05) (pred_4)
   goals met: 1 of 2
9. (op_2 obj_01 obj_05)
   deleted: (pred_1 obj_01 obj_05) (pred_4)
   added: (pred_5 obj_01)
   goals met: 1 of 2
10. (op_1 obj_05 obj_04)
   deleted: (pred_6 obj_05)
   added: (pred_6 obj_04)
   goals met: 1 of 2
11. (op_3 obj_01 obj_04)
   deleted: (pred_5 obj_01)
   added: (pred_1 obj_01 obj_04) (pred_4)
   goals met: 2 of 2
